
Процедура ДействияФормыОтметитьВсе(Кнопка)
	
	ТаблицаРолей.ЗаполнитьЗначения(Истина, "Пометка");
	
КонецПроцедуры

Процедура ДействияФормыСнятьВсе(Кнопка)
	
	ТаблицаРолей.ЗаполнитьЗначения(Ложь, "Пометка");

КонецПроцедуры

Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	ВыбранныеРоли = Новый СписокЗначений;
	Для каждого ЭлементСписка из ТаблицаРолей Цикл
		Если ЭлементСписка.Пометка Тогда
			МетаданныеРоль =  Метаданные.Роли[ЭлементСписка.Значение];
			ВыбранныеРоли.Добавить(МетаданныеРоль);
		КонецЕсли;
	КонецЦикла;
	
	Закрыть(ВыбранныеРоли);
	
КонецПроцедуры

Процедура ТаблицаРолейВыбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбраннаяСтрока.Пометка = НЕ ВыбраннаяСтрока.Пометка;
	
КонецПроцедуры
