
Функция РегВырСтрЗаменить(СтрокаДляРазбора,Паттерн,ПодстрокаЗамены) Экспорт
		
	РегВыр  = Новый COMОбъект("VBScript.RegExp");
	РегВыр.IgnoreCase = Ложь; //Игнорировать регистр
	РегВыр.Global = Истина; //Поиск всех вхождений шаблона
	РегВыр.MultiLine = Ложь; //Многострочный режим  			
	РегВыр.Pattern = Паттерн; 
	МассивСтрок=РегВыр.replace(СтрокаДляРазбора,ПодстрокаЗамены);
	Возврат МассивСтрок; 
	
КонецФункции

//получает дубил справочника Контрагенты на стороне УПП
Функция ПолучитьДублиУПП(МассивИНН) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка,
		|	Контрагенты.ИдентификационныйКодЛичности КАК ИНН
		//|	Контрагенты.КПП
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.ПометкаУдаления
		|	И Контрагенты.ИдентификационныйКодЛичности <> """"";

	ТЗ = Запрос.Выполнить().Выгрузить();
	
	ТЗДублиУПП = Новый ТаблицаЗначений;
	ТЗДублиУПП.Колонки.Добавить("Ссылка");
	ТЗДублиУПП.Колонки.Добавить("ИНН");
	//ТЗДублиУПП.Колонки.Добавить("КПП");
	Для Каждого Стр Из МассивИНН Цикл
		ПараметрыОтбора =  Новый Структура("ИНН",Стр);
		СтрокиТЗ = ТЗ.НайтиСтроки(ПараметрыОтбора);
		Если СтрокиТЗ.Количество()>1 Тогда
			Нстр = ТЗДублиУПП.Добавить();
			СтрМассив = СтрокиТЗ[0];
			ЗаполнитьЗначенияСвойств(Нстр,СтрМассив); 
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТЗДублиУПП;

КонецФункции
