Перем СохраненнаяНастройка Экспорт;        // Текущий вариант отчета

Перем ТаблицаВариантовОтчета Экспорт;      // Таблица вариантов доступных текущему пользователю

#Если Клиент ИЛИ ВнешнееСоединение Тогда
	
Функция СформироватьОтчет(Результат = Неопределено, ДанныеРасшифровки = Неопределено, ВыводВФормуОтчета = Истина) Экспорт
	
	//ЗначениеПанелипользователя = ТиповыеОтчеты.ПолучитьЗначенияНастроекПанелиПользователяОбъекта(ЭтотОбъект);
	НастрокаПоУмолчанию        = КомпоновщикНастроек.ПолучитьНастройки();
	ТиповыеОтчеты.ПолучитьПримененуюНастройку(ЭтотОбъект);
		
	ТиповыеОтчеты.СформироватьТиповойОтчет(ЭтотОбъект, Результат, ДанныеРасшифровки, ВыводВФормуОтчета, Новый Структура("ТаблицаДанных", ПолучитьТаблицуДанных()));
	КомпоновщикНастроек.ЗагрузитьНастройки(НастрокаПоУмолчанию);
		
КонецФункции

Процедура СохранитьНастройку() Экспорт

	СтруктураНастроек = ТиповыеОтчеты.ПолучитьСтруктуруПараметровТиповогоОтчета(ЭтотОбъект);
	СохранениеНастроек.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);
	
КонецПроцедуры

Процедура ПрименитьНастройку() Экспорт
	
	Схема = ТиповыеОтчеты.ПолучитьСхемуКомпоновкиОбъекта(ЭтотОбъект);

	//ЗагрузитьНастройкиИзМакета();
	
	// Считываение структуры настроек отчета
 	Если Не СохраненнаяНастройка.Пустая() Тогда
		
		СтруктураНастроек = СохраненнаяНастройка.ХранилищеНастроек.Получить();
		Если Не СтруктураНастроек = Неопределено Тогда
			КомпоновщикНастроек.ЗагрузитьНастройки(СтруктураНастроек.НастройкиКомпоновщика);
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураНастроек);
		Иначе
			КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
		КонецЕсли;
		
	Иначе
		КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
	КонецЕсли;

КонецПроцедуры

//Процедура ПередВыводомЭлементРезультата(МакетКомпоновки, ПроцессорКомпоновки, ЭлементРезультата) Экспорт
//КонецПроцедуры

//Процедура ПередВыводомОтчета(МакетКомпоновки, ПроцессорКомпоновки) Экспорт
//КонецПроцедуры

//Процедура ПриВыводеЗаголовкаОтчета(ОбластьЗаголовок) Экспорт
//КонецПроцедуры

Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	СтруктураНатроек = Новый Структура();
	//СтруктураНатроек.Вставить("ИспользоватьСобытияПриФормированииОтчета", истина);
	//СтруктураНатроек.Вставить("ПриВыводеЗаголовкаОтчета",                 истина);
	//СтруктураНатроек.Вставить("ПослеВыводаПанелиПользователя",            истина);
	//СтруктураНатроек.Вставить("ПослеВыводаПериода",                       истина);
	//СтруктураНатроек.Вставить("ПослеВыводаПараметра",                     истина);
	//СтруктураНатроек.Вставить("ПослеВыводаГруппировки",                   истина);
	//СтруктураНатроек.Вставить("ПослеВыводаОтбора",                        истина);
	//СтруктураНатроек.Вставить("ДействияПанелиИзменениеФлажкаДопНастроек", истина);
	//СтруктураНатроек.Вставить("ПриПолучениеНастроекПользователя",         истина);
	Возврат СтруктураНатроек;
КонецФункции

#КонецЕсли

#Если Клиент Тогда
	
// Настройка отчета при отработки расшифровки
Процедура Настроить(Отбор) Экспорт
	
	// Настройка отбора
	Для каждого ЭлементОтбора Из Отбор Цикл
		
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ПолеОтбора = ЭлементОтбора.ЛевоеЗначение;
		Иначе
			ПолеОтбора = Новый ПолеКомпоновкиДанных(ЭлементОтбора.Поле);
		КонецЕсли;
		
		Если КомпоновщикНастроек.Настройки.ДоступныеПоляОтбора.НайтиПоле(ПолеОтбора) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйЭлементОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Если ТипЗнч(ЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			ЗаполнитьЗначенияСвойств(НовыйЭлементОтбора, ЭлементОтбора);
		Иначе
			НовыйЭлементОтбора.Использование  = Истина;
			НовыйЭлементОтбора.ЛевоеЗначение  = ПолеОтбора;
			Если ЭлементОтбора.Иерархия Тогда
				Если ТипЗнч(ЭлементОтбора.Значение) = Тип("СписокЗначений") Тогда
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
				Иначе
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
				КонецЕсли;
			Иначе
				Если ТипЗнч(ЭлементОтбора.Значение) = Тип("СписокЗначений") Тогда
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				Иначе
					НовыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				КонецЕсли;
			КонецЕсли;
			
			НовыйЭлементОтбора.ПравоеЗначение = ЭлементОтбора.Значение;
			
		КонецЕсли;
				
	КонецЦикла;
	
	ТиповыеОтчеты.УдалитьДублиОтбора(КомпоновщикНастроек);
	
КонецПроцедуры

#КонецЕсли

Процедура ДоработатьКомпоновщикПередВыводом() Экспорт
	
КонецПроцедуры


Функция ПолучитьТекстЗапроса()
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК ДатаКалендаря,
	|	1 КАК Количество
	|ПОМЕСТИТЬ ПроизводственныйКалендарь
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий)
	|			ИЛИ РегламентированныйПроизводственныйКалендарь.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГрафикиРаботыПоВидамВремени.ГрафикРаботы КАК ГрафикРаботы,
	|	ГрафикиРаботыПоВидамВремени.Дата КАК Дата,
	|	ГрафикиРаботыПоВидамВремени.ОсновноеЗначение КАК Количество
	|ПОМЕСТИТЬ ГрафикиРаботы
	|ИЗ
	|	РегистрСведений.ГрафикиРаботыПоВидамВремени КАК ГрафикиРаботыПоВидамВремени
	|ГДЕ
	|	ГрафикиРаботыПоВидамВремени.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ГрафикиРаботыПоВидамВремени.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.ВидыУчетаВремени.ПоДням)
	|	И ГрафикиРаботыПоВидамВремени.ОсновноеЗначение <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РаботникиОрганизаций.Период КАК Период,
	|	РаботникиОрганизаций.Организация КАК Организация,
	|	РаботникиОрганизаций.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизаций.ПодразделениеОрганизации КАК Подразделение,
	|	РаботникиОрганизаций.Должность КАК Должность,
	|	РаботникиОрганизаций.ГрафикРаботы КАК ГрафикРаботы,
	|	РаботникиОрганизаций.ПричинаИзмененияСостояния КАК ПричинаИзмененияСостояния
	|ПОМЕСТИТЬ ПериодыРаботы
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|ГДЕ
	|	ВЫБОР
	|			КОГДА РаботникиОрганизаций.ПериодЗавершения = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ РаботникиОрганизаций.ПериодЗавершения >= &НачалоПериода
	|		КОНЕЦ
	|	И РаботникиОрганизаций.Период <= &КонецПериода
	|	И РаботникиОрганизаций.Активность
	|	И НЕ &ВидУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаботникиОрганизаций.ПериодЗавершения,
	|	РаботникиОрганизаций.Организация,
	|	РаботникиОрганизаций.Сотрудник,
	|	РаботникиОрганизаций.ПодразделениеОрганизацииЗавершения,
	|	РаботникиОрганизаций.ДолжностьЗавершения,
	|	РаботникиОрганизаций.ГрафикРаботыЗавершения,
	|	РаботникиОрганизаций.ПричинаИзмененияСостоянияЗавершения
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|ГДЕ
	|	РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|	И РаботникиОрганизаций.ПериодЗавершения >= &НачалоПериода
	|	И РаботникиОрганизаций.Период <= &КонецПериода
	|	И РаботникиОрганизаций.Активность
	|	И НЕ &ВидУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Работники.Период,
	|	""Предприятие"",
	|	Работники.ФизЛицо,
	|	Работники.Подразделение,
	|	Работники.Должность,
	|	Работники.ГрафикРаботы,
	|	Работники.ПричинаИзмененияСостояния
	|ИЗ
	|	РегистрСведений.Работники КАК Работники
	|ГДЕ
	|	Работники.Активность
	|	И &ВидУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПериодыРаботы.Период КАК Период,
	|	ДатыРаботы.Период КАК ПериодПроверки,
	|	ПериодыРаботы.Организация КАК Организация,
	|	ПериодыРаботы.Сотрудник КАК Сотрудник,
	|	РАЗНОСТЬДАТ(ПериодыРаботы.Период, ДатыРаботы.Период, ДЕНЬ) * 60 * 60 * 24 КАК РазностьДат
	|ПОМЕСТИТЬ РазностиДат
	|ИЗ
	|	ПериодыРаботы КАК ПериодыРаботы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ПериодыРаботы.Период КАК Период,
	|			ПериодыРаботы.Сотрудник КАК Сотрудник,
	|			ПериодыРаботы.Организация КАК Организация
	|		ИЗ
	|			ПериодыРаботы КАК ПериодыРаботы) КАК ДатыРаботы
	|		ПО ПериодыРаботы.Сотрудник = ДатыРаботы.Сотрудник
	|			И ПериодыРаботы.Период < ДатыРаботы.Период
	|			И ПериодыРаботы.Организация = ДатыРаботы.Организация
	|ГДЕ
	|	РАЗНОСТЬДАТ(ПериодыРаботы.Период, ДатыРаботы.Период, ДЕНЬ) * 60 * 60 * 24 > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РазностиДат.Период КАК Период,
	|	РазностиДат.Организация КАК Организация,
	|	РазностиДат.Сотрудник КАК Сотрудник,
	|	МИНИМУМ(РазностиДат.РазностьДат) КАК РазностьДат
	|ПОМЕСТИТЬ ВТ_Проверки
	|ИЗ
	|	РазностиДат КАК РазностиДат
	|
	|СГРУППИРОВАТЬ ПО
	|	РазностиДат.Период,
	|	РазностиДат.Сотрудник,
	|	РазностиДат.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РазностиДат.Период КАК НачалоПериода,
	|	ДОБАВИТЬКДАТЕ(РазностиДат.ПериодПроверки, ДЕНЬ, -1) КАК КонецПериода,
	|	РазностиДат.Организация КАК Организация,
	|	РазностиДат.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ТаблицаПериодов
	|ИЗ
	|	РазностиДат КАК РазностиДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Проверки КАК ВТ_Проверки
	|		ПО РазностиДат.Период = ВТ_Проверки.Период
	|			И РазностиДат.РазностьДат = ВТ_Проверки.РазностьДат
	|			И РазностиДат.Сотрудник = ВТ_Проверки.Сотрудник
	|			И РазностиДат.Организация = ВТ_Проверки.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПериодыРаботы.Период КАК НачалоПериода,
	|	ТаблицаПериодов.КонецПериода КАК КонецПериода,
	|	ПериодыРаботы.Организация КАК Организация,
	|	ПериодыРаботы.Сотрудник КАК Сотрудник,
	|	ПериодыРаботы.Подразделение КАК Подразделение,
	|	ПериодыРаботы.Должность КАК Должность,
	|	ПериодыРаботы.ГрафикРаботы КАК ГрафикРаботы,
	|	ПериодыРаботы.ПричинаИзмененияСостояния КАК ПричинаИзмененияСостояния
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	ПериодыРаботы КАК ПериодыРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|		ПО ПериодыРаботы.Сотрудник = ТаблицаПериодов.Сотрудник
	|			И ПериодыРаботы.Период = ТаблицаПериодов.НачалоПериода
	|			И ПериодыРаботы.Организация = ТаблицаПериодов.Организация
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТаблицаПериодов.КонецПериода ЕСТЬ NULL 
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ТаблицаПериодов.КонецПериода >= &НачалоПериода
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НАЧАЛОПЕРИОДА(ВЫБОР
	|			КОГДА Результат.НачалоПериода < &НачалоПериода
	|				ТОГДА &НачалоПериода
	|			ИНАЧЕ Результат.НачалоПериода
	|		КОНЕЦ, ДЕНЬ) КАК НачалоПериода,
	|	НАЧАЛОПЕРИОДА(ВЫБОР
	|			КОГДА Результат.КонецПериода ЕСТЬ NULL 
	|				ТОГДА &КонецПериода
	|			КОГДА Результат.КонецПериода > &КонецПериода
	|				ТОГДА &КонецПериода
	|			ИНАЧЕ Результат.КонецПериода
	|		КОНЕЦ, ДЕНЬ) КАК КонецПериода,
	|	Результат.Организация КАК Организация,
	|	Результат.Сотрудник КАК Сотрудник,
	|	Результат.Подразделение КАК Подразделение,
	|	Результат.Должность КАК Должность,
	|	Результат.ГрафикРаботы КАК ГрафикРаботы,
	|	Результат.ПричинаИзмененияСостояния КАК ПричинаИзмененияСостояния
	|ПОМЕСТИТЬ Сотрудники
	|ИЗ
	|	Результат КАК Результат
	|ГДЕ
	|	Результат.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Сотрудники.НачалоПериода КАК НачалоПериода,
	|	Сотрудники.КонецПериода КАК КонецПериода,
	|	Сотрудники.Организация КАК Организация,
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.Подразделение КАК Подразделение,
	|	Сотрудники.Должность КАК Должность,
	|	Сотрудники.ГрафикРаботы КАК ГрафикРаботы,
	|	ГрафикиРаботы.Количество КАК НормаДнейПоГрафику,
	|	ПроизводственныйКалендарь.Количество КАК НормаДнейПокалендарю,
	|	ГрафикиРаботы.Дата КАК Дата,
	|	Сотрудники.ПричинаИзмененияСостояния
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГрафикиРаботы КАК ГрафикиРаботы
	|		ПО Сотрудники.ГрафикРаботы = ГрафикиРаботы.ГрафикРаботы
	|			И (ГрафикиРаботы.Дата МЕЖДУ Сотрудники.НачалоПериода И Сотрудники.КонецПериода)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПроизводственныйКалендарь КАК ПроизводственныйКалендарь
	|		ПО (ПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ Сотрудники.НачалоПериода И Сотрудники.КонецПериода)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.НачалоПериода,
	|	ВТ.КонецПериода,
	|	ВТ.Организация,
	|	ВТ.Сотрудник,
	|	ВТ.Подразделение,
	|	ВТ.Должность,
	|	ВТ.ГрафикРаботы,
	|	СУММА(ВТ.НормаДнейПоГрафику) КАК НормаДнейПоГрафику,
	|	СУММА(ВТ.НормаДнейПокалендарю) КАК НормаДнейПокалендарю,
	|	ВТ.ПричинаИзмененияСостояния
	|ПОМЕСТИТЬ ВТ1
	|ИЗ
	|	ВТ КАК ВТ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ.НачалоПериода,
	|	ВТ.КонецПериода,
	|	ВТ.Организация,
	|	ВТ.Сотрудник,
	|	ВТ.Подразделение,
	|	ВТ.Должность,
	|	ВТ.ГрафикРаботы,
	|	ВТ.ПричинаИзмененияСостояния
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВТ1.НачалоПериода,
	|	ВТ1.КонецПериода,
	|	ВТ1.Организация,
	|	ВТ1.Сотрудник,
	|	ВТ1.Подразделение,
	|	ВТ1.Должность,
	|	ВТ1.ГрафикРаботы,
	|	ВТ1.НормаДнейПоГрафику,
	|	ВТ1.НормаДнейПокалендарю,
	|	ВТ1.ПричинаИзмененияСостояния,
	|	СУММА(ТабельИтоги.Отработано) КАК Отработано,
	|	СУММА(ТабельИтоги.Невыходы) КАК Невыходы
	|ПОМЕСТИТЬ ВТ2
	|ИЗ
	|	ВТ1 КАК ВТ1
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РабочееВремяРаботниковОрганизацийОбороты.Период КАК Период,
	|			РабочееВремяРаботниковОрганизацийОбороты.Организация КАК Организация,
	|			РабочееВремяРаботниковОрганизацийОбороты.Сотрудник КАК Сотрудник,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Работа)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Командировка)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Праздники)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК Отработано,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Болезнь)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.БолезньБезОплаты)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ВынужденныйПрогул)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДополнительныеВыходныеДниНеОплачиваемые)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДополнительныеВыходныеДниОплачиваемые)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДополнительныйОтпуск)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Забастовка)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ЗадержкаВыплатыЗаработнойПлаты)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйДополнительныйОтпуск)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеявкиПоНевыясненнымПричинам)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтстранениеОтРаботыБезОплаты)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтстранениеОтРаботыСОплатой)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПовышениеКвалификации)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПовышениеКвалификацииВДругойМестности)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Прогулы)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботника)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботодателя)
	|						ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК Невыходы
	|		ИЗ
	|			РегистрНакопления.РабочееВремяРаботниковОрганизаций.Обороты(&НачалоПериода, &КонецПериода, Запись, ) КАК РабочееВремяРаботниковОрганизацийОбороты
	|		ГДЕ
	|			ВЫБОР
	|					КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Работа)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Командировка)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Праздники)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.БолезньБезОплаты)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ВынужденныйПрогул)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДополнительныеВыходныеДниНеОплачиваемые)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДополнительныеВыходныеДниОплачиваемые)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДополнительныйОтпуск)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Забастовка)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ЗадержкаВыплатыЗаработнойПлаты)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйДополнительныйОтпуск)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеявкиПоНевыясненнымПричинам)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтстранениеОтРаботыБезОплаты)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтстранениеОтРаботыСОплатой)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПовышениеКвалификации)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПовышениеКвалификацииВДругойМестности)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Прогулы)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботника)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботодателя)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК ТабельИтоги
	|		ПО (ВЫБОР
	|				КОГДА НЕ &ВидУчета
	|					ТОГДА ВТ1.Организация = ТабельИтоги.Организация
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НЕ &ВидУчета
	|					ТОГДА ВТ1.Сотрудник = ТабельИтоги.Сотрудник
	|				ИНАЧЕ ВТ1.Сотрудник = ТабельИтоги.Сотрудник.Физлицо
	|			КОНЕЦ)
	|			И (ТабельИтоги.Период МЕЖДУ ВТ1.НачалоПериода И ВТ1.КонецПериода)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ1.НачалоПериода,
	|	ВТ1.КонецПериода,
	|	ВТ1.Организация,
	|	ВТ1.Сотрудник,
	|	ВТ1.Подразделение,
	|	ВТ1.Должность,
	|	ВТ1.ГрафикРаботы,
	|	ВТ1.НормаДнейПоГрафику,
	|	ВТ1.НормаДнейПокалендарю,
	|	ВТ1.ПричинаИзмененияСостояния
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Табель.Период,
	|	ВТ2.НачалоПериода КАК НачалоПериода,
	|	ВТ2.КонецПериода КАК КонецПериода,
	|	ВТ2.Организация КАК Организация,
	|	ВТ2.Сотрудник.Код КАК ТабельныйНомер,
	|	ВТ2.Сотрудник КАК Сотрудник,
	|	ВТ2.Подразделение КАК Подразделение,
	|	ВТ2.Должность КАК Должность,
	|	ВТ2.ГрафикРаботы КАК ГрафикРаботы,
	|	ВТ2.НормаДнейПоГрафику КАК НормаДнейПоГрафику,
	|	ВТ2.НормаДнейПокалендарю КАК НормаДнейПокалендарю,
	|	Табель.Работа КАК Работа,
	|	Табель.Командировка КАК Командировка,
	|	Табель.Праздники КАК Праздники,
	|	Табель.БолезньБезОплаты КАК БолезньБезОплаты,
	|	Табель.ВынужденныйПрогул КАК ВынужденныйПрогул,
	|	Табель.ДополнительныеВыходныеДниНеОплачиваемые КАК ДополнительныеВыходныеДниНеОплачиваемые,
	|	Табель.ДополнительныеВыходныеДниОплачиваемые КАК ДополнительныеВыходныеДниОплачиваемые,
	|	Табель.ДополнительныйОтпуск КАК ДополнительныйОтпуск,
	|	Табель.Забастовка КАК Забастовка,
	|	Табель.ЗадержкаВыплатыЗаработнойПлаты КАК ЗадержкаВыплатыЗаработнойПлаты,
	|	Табель.НеоплачиваемыйДополнительныйОтпуск КАК НеоплачиваемыйДополнительныйОтпуск,
	|	Табель.НеоплачиваемыйОтпускПоРазрешениюРаботодателя КАК НеоплачиваемыйОтпускПоРазрешениюРаботодателя,
	|	Табель.НеявкиПоНевыясненнымПричинам КАК НеявкиПоНевыясненнымПричинам,
	|	Табель.ОсновнойОтпуск КАК ОсновнойОтпуск,
	|	Табель.ОтпускНаОбучение КАК ОтпускНаОбучение,
	|	Табель.ОтпускНаОбучениеНеоплачиваемый КАК ОтпускНаОбучениеНеоплачиваемый,
	|	Табель.ОтпускПоБеременностиИРодам КАК ОтпускПоБеременностиИРодам,
	|	Табель.ОтпускПоУходуЗаРебенком КАК ОтпускПоУходуЗаРебенком,
	|	Табель.ОтстранениеОтРаботыБезОплаты КАК ОтстранениеОтРаботыБезОплаты,
	|	Табель.ОтстранениеОтРаботыСОплатой КАК ОтстранениеОтРаботыСОплатой,
	|	Табель.ПовышениеКвалификации КАК ПовышениеКвалификации,
	|	Табель.ПовышениеКвалификацииВДругойМестности КАК ПовышениеКвалификацииВДругойМестности,
	|	Табель.Прогулы КАК Прогулы,
	|	Табель.ПростойПоВинеРаботника КАК ПростойПоВинеРаботника,
	|	Табель.ПростойПоВинеРаботодателя КАК ПростойПоВинеРаботодателя,
	|	Табель.ГосударственныеОбязанности КАК ГосударственныеОбязанности,
	|	ВТ2.ПричинаИзмененияСостояния,
	|	ВТ2.Отработано,
	|	ВТ2.Невыходы
	|ПОМЕСТИТЬ ВТ3
	|ИЗ
	|	ВТ2 КАК ВТ2
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РабочееВремяРаботниковОрганизацийОбороты.Период КАК Период,
	|			РабочееВремяРаботниковОрганизацийОбороты.Организация КАК Организация,
	|			РабочееВремяРаботниковОрганизацийОбороты.Сотрудник КАК Сотрудник,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Работа)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК Работа,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Командировка)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК Командировка,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Праздники)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК Праздники,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.БолезньБезОплаты)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК БолезньБезОплаты,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ВынужденныйПрогул)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ВынужденныйПрогул,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДополнительныеВыходныеДниНеОплачиваемые)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ДополнительныеВыходныеДниНеОплачиваемые,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДополнительныеВыходныеДниОплачиваемые)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ДополнительныеВыходныеДниОплачиваемые,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДополнительныйОтпуск)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ДополнительныйОтпуск,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Забастовка)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК Забастовка,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ЗадержкаВыплатыЗаработнойПлаты)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ЗадержкаВыплатыЗаработнойПлаты,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйДополнительныйОтпуск)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК НеоплачиваемыйДополнительныйОтпуск,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК НеоплачиваемыйОтпускПоРазрешениюРаботодателя,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеявкиПоНевыясненнымПричинам)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК НеявкиПоНевыясненнымПричинам,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ОсновнойОтпуск,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ОтпускНаОбучение,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ОтпускНаОбучениеНеоплачиваемый,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ОтпускПоБеременностиИРодам,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ОтпускПоУходуЗаРебенком,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтстранениеОтРаботыБезОплаты)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ОтстранениеОтРаботыБезОплаты,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтстранениеОтРаботыСОплатой)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ОтстранениеОтРаботыСОплатой,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПовышениеКвалификации)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ПовышениеКвалификации,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПовышениеКвалификацииВДругойМестности)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ПовышениеКвалификацииВДругойМестности,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Прогулы)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК Прогулы,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботника)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ПростойПоВинеРаботника,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботодателя)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ПростойПоВинеРаботодателя,
	|			ВЫБОР
	|				КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности)
	|					ТОГДА РабочееВремяРаботниковОрганизацийОбороты.ДнейОборот
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ГосударственныеОбязанности
	|		ИЗ
	|			РегистрНакопления.РабочееВремяРаботниковОрганизаций.Обороты(&НачалоПериода, &КонецПериода, Запись, ) КАК РабочееВремяРаботниковОрганизацийОбороты
	|		ГДЕ
	|			ВЫБОР
	|					КОГДА РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Работа)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Командировка)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Праздники)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.БолезньБезОплаты)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ВынужденныйПрогул)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДополнительныеВыходныеДниНеОплачиваемые)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДополнительныеВыходныеДниОплачиваемые)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ДополнительныйОтпуск)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Забастовка)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ЗадержкаВыплатыЗаработнойПлаты)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйДополнительныйОтпуск)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеоплачиваемыйОтпускПоРазрешениюРаботодателя)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.НеявкиПоНевыясненнымПричинам)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОсновнойОтпуск)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучение)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускНаОбучениеНеоплачиваемый)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтстранениеОтРаботыБезОплаты)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ОтстранениеОтРаботыСОплатой)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПовышениеКвалификации)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПовышениеКвалификацииВДругойМестности)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Прогулы)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботника)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ПростойПоВинеРаботодателя)
	|							ИЛИ РабочееВремяРаботниковОрганизацийОбороты.ВидИспользованияРабочегоВремени = ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.ГосударственныеОбязанности)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ) КАК Табель
	|		ПО (Табель.Период МЕЖДУ ВТ2.НачалоПериода И ВТ2.КонецПериода)
	|			И (ВЫБОР
	|				КОГДА НЕ &ВидУчета
	|					ТОГДА ВТ2.Сотрудник = Табель.Сотрудник
	|				ИНАЧЕ ВТ2.Сотрудник = Табель.Сотрудник.Физлицо
	|			КОНЕЦ)
	|			И (ВЫБОР
	|				КОГДА НЕ &ВидУчета
	|					ТОГДА ВТ2.Организация = Табель.Организация
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ3.НачалоПериода,
	|	ВТ3.КонецПериода,
	|	ВТ3.Организация,
	|	ВТ3.ТабельныйНомер,
	|	ВТ3.Сотрудник,
	|	ВТ3.Подразделение,
	|	ВТ3.Должность,
	|	ВТ3.ГрафикРаботы,
	|	ВТ3.НормаДнейПоГрафику КАК НормаДнейПоГрафику,
	|	ВТ3.НормаДнейПокалендарю КАК НормаДнейПокалендарю,
	|	СУММА(ВТ3.Работа) КАК Работа,
	|	СУММА(ВТ3.Командировка) КАК Командировка,
	|	СУММА(ВТ3.Праздники) КАК Праздники,
	|	СУММА(ВТ3.БолезньБезОплаты) КАК БолезньБезОплаты,
	|	СУММА(ВТ3.ВынужденныйПрогул) КАК ВынужденныйПрогул,
	|	СУММА(ВТ3.ДополнительныеВыходныеДниНеОплачиваемые) КАК ДополнительныеВыходныеДниНеОплачиваемые,
	|	СУММА(ВТ3.ДополнительныеВыходныеДниОплачиваемые) КАК ДополнительныеВыходныеДниОплачиваемые,
	|	СУММА(ВТ3.ДополнительныйОтпуск) КАК ДополнительныйОтпуск,
	|	СУММА(ВТ3.Забастовка) КАК Забастовка,
	|	СУММА(ВТ3.ЗадержкаВыплатыЗаработнойПлаты) КАК ЗадержкаВыплатыЗаработнойПлаты,
	|	СУММА(ВТ3.НеоплачиваемыйДополнительныйОтпуск) КАК НеоплачиваемыйДополнительныйОтпуск,
	|	СУММА(ВТ3.НеоплачиваемыйОтпускПоРазрешениюРаботодателя) КАК НеоплачиваемыйОтпускПоРазрешениюРаботодателя,
	|	СУММА(ВТ3.НеявкиПоНевыясненнымПричинам) КАК НеявкиПоНевыясненнымПричинам,
	|	СУММА(ВТ3.ОсновнойОтпуск) КАК ОсновнойОтпуск,
	|	СУММА(ВТ3.ОтпускНаОбучение) КАК ОтпускНаОбучение,
	|	СУММА(ВТ3.ОтпускНаОбучениеНеоплачиваемый) КАК ОтпускНаОбучениеНеоплачиваемый,
	|	СУММА(ВТ3.ОтпускПоБеременностиИРодам) КАК ОтпускПоБеременностиИРодам,
	|	СУММА(ВТ3.ОтпускПоУходуЗаРебенком) КАК ОтпускПоУходуЗаРебенком,
	|	СУММА(ВТ3.ОтстранениеОтРаботыБезОплаты) КАК ОтстранениеОтРаботыБезОплаты,
	|	СУММА(ВТ3.ОтстранениеОтРаботыСОплатой) КАК ОтстранениеОтРаботыСОплатой,
	|	СУММА(ВТ3.ПовышениеКвалификации) КАК ПовышениеКвалификации,
	|	СУММА(ВТ3.ПовышениеКвалификацииВДругойМестности) КАК ПовышениеКвалификацииВДругойМестности,
	|	СУММА(ВТ3.Прогулы) КАК Прогулы,
	|	СУММА(ВТ3.ПростойПоВинеРаботника) КАК ПростойПоВинеРаботника,
	|	СУММА(ВТ3.ПростойПоВинеРаботодателя) КАК ПростойПоВинеРаботодателя,
	|	СУММА(ВТ3.ГосударственныеОбязанности) КАК ГосударственныеОбязанности,
	|	ВТ3.ПричинаИзмененияСостояния,
	|	ВТ3.Отработано,
	|	ВТ3.Невыходы,
	|	ЕСТЬNULL(ВТ3.НормаДнейПоГрафику, 0) - ЕСТЬNULL(ВТ3.Отработано, 0) - ЕСТЬNULL(ВТ3.Невыходы, 0) КАК Ошибка,
	|	ВЫБОР
	|		КОГДА ВТ3.Сотрудник ССЫЛКА Справочник.СотрудникиОрганизаций
	|			ТОГДА ВТ3.Сотрудник
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
	|	КОНЕЦ КАК СотрудникРегл,
	|	ВЫБОР
	|		КОГДА ВТ3.Сотрудник ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ВТ3.Сотрудник
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	КОНЕЦ КАК СотрудникУпр,
	|	ВЫБОР
	|		КОГДА ВТ3.Подразделение ССЫЛКА Справочник.ПодразделенияОрганизаций
	|			ТОГДА ВТ3.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|	КОНЕЦ КАК ПодразделениеРегл,
	|	ВЫБОР
	|		КОГДА ВТ3.Подразделение ССЫЛКА Справочник.Подразделения
	|			ТОГДА ВТ3.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ КАК ПодразделениеУпр
	|ИЗ
	|	ВТ3 КАК ВТ3
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ3.НачалоПериода,
	|	ВТ3.КонецПериода,
	|	ВТ3.Организация,
	|	ВТ3.ТабельныйНомер,
	|	ВТ3.Сотрудник,
	|	ВТ3.Подразделение,
	|	ВТ3.Должность,
	|	ВТ3.ГрафикРаботы,
	|	ВТ3.ПричинаИзмененияСостояния,
	|	ВТ3.Отработано,
	|	ВТ3.Невыходы,
	|	ВТ3.НормаДнейПоГрафику,
	|	ВТ3.НормаДнейПокалендарю,
	|	ВЫБОР
	|		КОГДА ВТ3.Сотрудник ССЫЛКА Справочник.СотрудникиОрганизаций
	|			ТОГДА ВТ3.Сотрудник
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СотрудникиОрганизаций.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТ3.Сотрудник ССЫЛКА Справочник.ФизическиеЛица
	|			ТОГДА ВТ3.Сотрудник
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТ3.Подразделение ССЫЛКА Справочник.ПодразделенияОрганизаций
	|			ТОГДА ВТ3.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТ3.Подразделение ССЫЛКА Справочник.Подразделения
	|			ТОГДА ВТ3.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	КОНЕЦ,
	|	ЕСТЬNULL(ВТ3.НормаДнейПоГрафику, 0) - ЕСТЬNULL(ВТ3.Отработано, 0) - ЕСТЬNULL(ВТ3.Невыходы, 0)";
	
	Возврат ТекстЗапроса;
	
КонецФункции


Функция ПолучитьТаблицуДанных()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода",	ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[1].Значение);
	Запрос.УстановитьПараметр("КонецПериода",	ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[2].Значение);
	Запрос.УстановитьПараметр("ВидУчета",		ЭтотОбъект.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[3].Значение);
	
	Запрос.Текст = ПолучитьТекстЗапроса();
	РезультатЗапроса = Запрос.Выполнить();
		
	//РезультатЗапроса.Выгрузить().ВыбратьСтроку();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции


Процедура ЗагрузитьНастройкиИзМакета() Экспорт
	
	Попытка
		
		Если НЕ СохраненнаяНастройка.Пустая() Тогда
			Возврат;
		КонецЕсли;
	
		НачатьТранзакцию();
		
		// Настройка "управленческий учет по дням"
		ИмяФайла=ПолучитьИмяВременногоФайла("txt");
		МакетНастроек = ЭтотОбъект.ПолучитьМакет(ЭтотОбъект.Метаданные().Имя + "_УпрУчетПоДням");
		МакетНастроек.Записать(ИмяФайла);
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.Прочитать(ИмяФайла);
		Настройка = ТиповыеОтчеты.ПолучитьНастройкуОтчета(ТекстовыйДокумент.ПолучитьТекст());
		УдалитьФайлы(ИмяФайла);

		СохраненнаяНастройка = Справочники.СохраненныеНастройки.СоздатьЭлемент();
		СохраненнаяНастройка.НастраиваемыйОбъект = Настройка.НастраиваемыйОбъект;
		СохраненнаяНастройка.ТипНастройки = Перечисления.ТипыНастроек.НастройкиОтчета;
		СохраненнаяНастройка.Наименование = Настройка.Наименование;
		СохраненнаяНастройка.Описание = Настройка.Описание;
		НоваяСтрока = СохраненнаяНастройка.Пользователи.Добавить();
		НоваяСтрока.Пользователь = Справочники.ГруппыПользователей.ВсеПользователи;
		НоваяСтрока.ПравоИзменения = истина;
		СохраненнаяНастройка.ХранилищеНастроек = Новый ХранилищеЗначения(Настройка.ХранилищеНастроек.Получить());
		СохраненнаяНастройка.Записать();
		
		СохраненнаяНастройка = СохраненнаяНастройка.Ссылка;

		// Настройка "регламентированный учет по дням"
		ИмяФайла=ПолучитьИмяВременногоФайла("txt");
		МакетНастроек = ЭтотОбъект.ПолучитьМакет(ЭтотОбъект.Метаданные().Имя + "_РеглУчетПоДням");
		МакетНастроек.Записать(ИмяФайла);
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.Прочитать(ИмяФайла);
		Настройка = ТиповыеОтчеты.ПолучитьНастройкуОтчета(ТекстовыйДокумент.ПолучитьТекст());
		УдалитьФайлы(ИмяФайла);

		СохраненнаяНастройка = Справочники.СохраненныеНастройки.СоздатьЭлемент();
		СохраненнаяНастройка.НастраиваемыйОбъект = Настройка.НастраиваемыйОбъект;
		СохраненнаяНастройка.ТипНастройки = Перечисления.ТипыНастроек.НастройкиОтчета;
		СохраненнаяНастройка.Наименование = Настройка.Наименование;
		СохраненнаяНастройка.Описание = Настройка.Описание;
		НоваяСтрока = СохраненнаяНастройка.Пользователи.Добавить();
		НоваяСтрока.Пользователь = Справочники.ГруппыПользователей.ВсеПользователи;
		НоваяСтрока.ПравоИзменения = истина;
		СохраненнаяНастройка.ХранилищеНастроек = Новый ХранилищеЗначения(Настройка.ХранилищеНастроек.Получить());
		СохраненнаяНастройка.Записать();
		
		СохраненнаяНастройка = СохраненнаяНастройка.Ссылка;
		
		ФормаОтчета = ЭтотОбъект.ПолучитьФорму("ФормаОтчета");
		
		Если ФормаОтчета.Открыта() Тогда
			ТиповыеОтчеты.ОбновитьТаблицуДоступныхНастроекПользователю(ЭтотОбъект);
			ТиповыеОтчеты.ОбновитьКнопкиВыбораНастроек(ФормаОтчета, ЭтотОбъект, ФормаОтчета.ПредставлениеНастройки, ФормаОтчета.РежимРедактированияНастройки);
			ФормаОтчета.ЭлементыФормы.СервиснаяПанель.Кнопки.ПанельВариантов.Пометка = Истина;
			ТиповыеОтчеты.УправлениеОтображениемПанелиВариантов(ФормаОтчета);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры

Если СохраненнаяНастройка = Неопределено Тогда
	СохраненнаяНастройка =  Справочники.СохраненныеНастройки.ПустаяСсылка();
КонецЕсли;
