
&НаКлиенте
Процедура ПодобратьУчастниковРабочейГруппы(Команда)
	
	РаботаСАдреснойКнигойКлиент.ПодобратьУчастниковРабочейГруппы(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	
	Если ВидДокумента.Пустая() Тогда
		ПоказатьПредупреждение(,"Сначала выберите вид документа!");
		Возврат;
	КонецЕсли;
	
	Если РабочаяГруппаТаблица.Количество() = 0  Тогда
		ПоказатьПредупреждение(,"Выбрите участников рабочей группы!");
		Возврат;
	КонецЕсли;
	
	ДобавитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьНаСервере()
	
	ТЗУчастников = РеквизитФормыВЗначение("РабочаяГруппаТаблица");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнутренниеДокументы.Ссылка
		|ИЗ
		|	Справочник.ВнутренниеДокументы КАК ВнутренниеДокументы
		|ГДЕ
		|	ВнутренниеДокументы.ВидДокумента = &ВидДокумента
		|	И ВнутренниеДокументы.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Для Каждого Стр Из ТЗУчастников Цикл
			МенеджерРабочейГруппы = РегистрыСведений.РабочиеГруппы.СоздатьМенеджерЗаписи();
			МенеджерРабочейГруппы.Объект = ВыборкаДетальныеЗаписи.Ссылка;
			МенеджерРабочейГруппы.Участник = Стр.Участник;
			МенеджерРабочейГруппы.Изменение = Стр.Изменение;
			
			МенеджерРабочейГруппы.Записать(Истина);
		КонецЦикла;
		
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)
	ВидДокументаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидДокументаПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВнутренниеДокументы.Ссылка) КАК Ссылка
		|ИЗ
		|	Справочник.ВнутренниеДокументы КАК ВнутренниеДокументы
		|ГДЕ
		|	ВнутренниеДокументы.ВидДокумента = &ВидДокумента
		|	И ВнутренниеДокументы.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		элементы.Декорация2.Заголовок = "Всего документов :"+ВыборкаДетальныеЗаписи.ССылка+" шт";
	КонецЦикла;
	
КонецПроцедуры

Процедура sdghsdfg()

	

КонецПроцедуры
