Перем НастройкаПериода;

Процедура ВыбПериодНажатие()
	Если НастройкаПериода.Редактировать() Тогда
		НачПериода = НастройкаПериода.ПолучитьДатуНачала();
		КонПериода = НастройкаПериода.ПолучитьДатуОкончания();
	КонецЕсли;
	НачПериодаПриИзменении();
	КонПериодаПриИзменении();
КонецПроцедуры

Процедура НачПериодаПриИзменении()
	ПараметрДатаНач = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	ПараметрДатаНач.Использование = Истина;
	ПараметрДатаНач.Значение  = НачалоДня(НачПериода);
КонецПроцедуры

Процедура КонПериодаПриИзменении()
	ПараметрДатаНач = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	ПараметрДатаНач.Использование = Истина;
	ПараметрДатаНач.Значение  = КонецДня(КонПериода);
КонецПроцедуры

Процедура ПодразделениеПриИзменении(Элемент)
	ПолеПодразделение = Новый ПолеКомпоновкиДанных("ПодразделениеОрганизации");
	Для каждого Элемент Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если Элемент.ЛевоеЗначение = ПолеПодразделение Тогда
			ЭлементОтбора = Элемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Подразделение;
	ЭлементОтбора.Использование = НЕ Подразделение.Пустая();
КонецПроцедуры

НачПериода = НачалоМесяца(ТекущаяДата());
КонПериода = КонецМесяца(ТекущаяДата());
НастройкаПериода = Новый НастройкаПериода;
НастройкаПериода.РедактироватьКакИнтервал = Истина;
НастройкаПериода.РедактироватьКакПериод = Истина;
НастройкаПериода.ВариантНастройки = ВариантНастройкиПериода.Период;
НастройкаПериода.ВариантПериода=ВариантПериода.Месяц;
НачПериодаПриИзменении();
КонПериодаПриИзменении();
