Функция Проверка()
	ВсеКорректно = Истина;
	Если Организация.Пустая() Тогда
		Сообщить("Не указана организация!");
		ВсеКорректно = Ложь;
	КонецЕсли;	
	Возврат ВсеКорректно;	
КонецФункции

//---------------------------------------------------------------------------------------------------------------------------------

Процедура КнопкаСформироватьНажатие(Кнопка)	
	Если Не Проверка() Тогда
		Возврат;
	КонецЕсли;	
	
	Таб = ЭлементыФормы.Результат;
    Таб.Очистить();
	
	Таб.ОриентацияСтраницы = ?(Ориентация = 0, ОриентацияСтраницы.Портрет, ОриентацияСтраницы.Ландшафт);
	Таб.МасштабПечати = Масштаб;
	Таб.АвтоМасштаб = ?(АвтоМасштаб = 1, Истина, Ложь);
	Таб.ПолеСнизу = 40;
	Таб.ПолеСлева = 15;
	Таб.ПолеСправа = 15;
	Таб.ПолеСверху = 15;
	СформироватьОтчет(Таб);
	Таб.ПолеСнизу = 10;
КонецПроцедуры

//---------------------------------------------------------------------------------------------------------------------------------

Процедура ПериодРегистрацииНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	РаботаСДиалогами.НачалоВыбораИзСпискаПредставленияПериодаРегистрации(Элемент, СтандартнаяОбработка, ПериодРегистрации, ЭтаФорма);
КонецПроцедуры

//---------------------------------------------------------------------------------------------------------------------------------

Процедура ПериодРегистрацииПриИзменении(Элемент)
	РаботаСДиалогами.ДатаКакМесяцПодобратьДатуПоТексту(Элемент.Значение, ПериодРегистрации);	
	Элемент.Значение           = РаботаСДиалогами.ДатаКакМесяцПредставление(ПериодРегистрации);
КонецПроцедуры

//---------------------------------------------------------------------------------------------------------------------------------

Процедура ПериодРегистрацииОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

//---------------------------------------------------------------------------------------------------------------------------------

Процедура ПериодРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	ПериодРегистрации    = ДобавитьМесяц(ПериодРегистрации, Направление);
	Элемент.Значение = РаботаСДиалогами.ДатаКакМесяцПредставление(ПериодРегистрации);
КонецПроцедуры

//---------------------------------------------------------------------------------------------------------------------------------

Процедура ПериодРегистрацииАвтоПодборТекста(Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка)
	РаботаСДиалогами.ДатаКакМесяцАвтоПодборТекста(Текст, ТекстАвтоПодбора, СтандартнаяОбработка);
КонецПроцедуры

//---------------------------------------------------------------------------------------------------------------------------------

Процедура ПриОткрытии()
	Если ПериодРегистрации = '00010101' Тогда
		ПериодРегистрации =НачалоМесяца(ОбщегоНазначения.ПолучитьРабочуюДату());
	КонецЕсли;
	
	ЭлементыФормы.ПериодРегистрации.Значение = РаботаСДиалогами.ДатаКакМесяцПредставление(ПериодРегистрации);
	ЭлементыФормы.ПанельОтборов.Свертка = РежимСверткиЭлементаУправления.Нет ;
	мДоступнаРольРасчетчика = (НастройкаПравДоступаПереопределяемый.ДоступнаРольРасчетчикаРегл() ИЛИ РольДоступна("ПолныеПрава"));
	Если Не мДоступнаРольРасчетчика Тогда
		Сообщить("У Вас нет прав доступа на формирование отчета"); 
		ЭтаФорма.Закрыть();
	КонецЕсли;

КонецПроцедуры

//---------------------------------------------------------------------------------------------------------------------------------

Процедура КнопкаОтборыНажатие(Элемент)
	Если ЭлементыФормы.ПанельОтборов.Свертка = РежимСверткиЭлементаУправления.Нет Тогда
		ЭлементыФормы.ПанельОтборов.Свертка = РежимСверткиЭлементаУправления.Право; 
	Иначе
		ЭлементыФормы.ПанельОтборов.Свертка = РежимСверткиЭлементаУправления.Нет ;
	КонецЕсли;	
КонецПроцедуры
