
Процедура ОсновныеДействияФормыОК(Кнопка)
	ЗакрытьФорму();
КонецПроцедуры

Процедура ЗакрытьФорму(Сформировать = Ложь)
	
	ВладелецФормы.АдресТелематическогоСервера = АдресТелематическогоСервера;
	ВладелецФормы.ПортТелематическогоСервера = ПортТелематическогоСервера;      
	ВладелецФормы.ЧасовойПояс = ЧасовойПояс;      
	ВладелецФормы.Логин = Логин;      
	ВладелецФормы.Пароль = Пароль;      
	ВладелецФормы.ИдОтчетаДляПолученияДанных = ИдОтчетаДляПолученияДанных;      
	ВладелецФормы.ИдШаблонаДляПолученияДанных = ИдШаблонаДляПолученияДанных; 
	ВладелецФормы.ИдШаблонаДляЗаправок = ИдШаблонаДляЗаправок; 
	ВладелецФормы.ХранениеИдТехники = ХранениеИдТехники;      
	ВладелецФормы.СвойствоАЗС = СвойствоАЗС;      
	ВладелецФормы.СвойствоАТЗ = СвойствоАТЗ;      
	ВладелецФормы.Токен = Токен;      
	
	Закрыть(Сформировать);		
КонецПроцедуры

Процедура ПриОткрытии()
	//СВ = ЭлементыФормы.ПустоеПоле.СписокВыбора;
	//СВ.Добавить("-");
	//СВ.Добавить(" ");
	//СВ.Добавить("0");
	//
	//УстановитьДоступностьКоэффициентов();
	
КонецПроцедуры

Процедура ОсновныеДействияФормыСформировать(Кнопка)
	ЗакрытьФорму(Истина)
КонецПроцедуры

