////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЕстьПраваНаАдминистрирование() Тогда
		Предупреждение("Для использования обработки необходимо иметь право доступа ""Администрирование""");
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриОткрытии()
	
	ЭлементыФормы.ПолеТабличногоДокумента.ФиксацияСлева = 2;	
	СформироватьТабличныйДокумент(ЭлементыФормы.ПолеТабличногоДокумента);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

Процедура ДействияФормыУстановить(Кнопка)
	
	УстановитьДляОбластиЯчеек(ЭлементыФормы.ПолеТабличногоДокумента, Истина);
	
КонецПроцедуры

Процедура ДействияФормыСнять(Кнопка)
	
	УстановитьДляОбластиЯчеек(ЭлементыФормы.ПолеТабличногоДокумента, Ложь);
	
КонецПроцедуры

Процедура ДействияФормыОбновить(Кнопка)
	
	СформироватьТабличныйДокумент(ЭлементыФормы.ПолеТабличногоДокумента);
	
КонецПроцедуры

Процедура ДействияФормыСписокРолей(Кнопка)
	
	ФормаВыбораРолей = ОбработкаОбъект.ПолучитьФорму("ФормаВыборРолейОбычноеПриложение");
	//Передаём в форму выбора текущий список ролей
	Для каждого Роль Из Метаданные.Роли Цикл
		НоваяСтрока = ФормаВыбораРолей.ТаблицаРолей.Добавить();
		НоваяСтрока.Пометка = (СписокРолей.НайтиПоЗначению(Роль) <> Неопределено);
		НоваяСтрока.Значение = Роль.Имя;
		НоваяСтрока.Представление = Роль.Синоним;
	КонецЦикла;
	
	ВыбранныеРоли = ФормаВыбораРолей.ОткрытьМодально();
	
	Если ВыбранныеРоли <> Неопределено Тогда
		Если ВыбранныеРоли.Количество() > 0 Тогда
			СписокРолей = ВыбранныеРоли;
			СформироватьТабличныйДокумент(ЭлементыФормы.ПолеТабличногоДокумента);
		КонецЕсли; 	
	КонецЕсли;  
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Обработчик события ОбработкаРасшифровки элемента ПолеТабличногоДокумента.
//
Процедура ПолеТабличногоДокументаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	ОбработкаРасшифровкиПоляТабличногоДокумента(ЭлементыФормы.ПолеТабличногоДокумента, Элемент, Расшифровка, СтандартнаяОбработка);

КонецПроцедуры

Процедура ДействияФормыПроголосовать(Кнопка)
	
	ЗапуститьПриложение("http://infostart.ru/public/85228/?rate=1");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

//При открытии или инициализации проверяем переданный программно список ролей для формирования
//матрицы. 
//Если список пустой, формируем его из метаданных конфигурации

Если СписокРолей.Количество() = 0 Тогда
	Для Каждого Роль из Метаданные.Роли Цикл
		СписокРолей.Добавить(Роль);
	КонецЦикла;
КонецЕсли;

СформироватьТаблицуПользователей();